emacs_study/Gnu_Emacs_Reference_Card.org
#+TITLE GNU Emacs Reference Card
* Leaving Emacs
** suspend Emacs (or inconify it under X)                      C-z
** exit Emacs permanently                                      C-x C-c
* Files
** read a file into Emacs                                      C-x C-f
** save a file back to disk                                    C-x C-s
** save all files                                              C-x s
** insert contents of another file into this buffer            C-x i
** replace this file with the file you really want             C-x C-v
** write buffer to a specified file                            C-x C-w
** toggle read-olny status of buffer                           C-x C-q
* Getting Help
  The help system is simple. Type *C-h*(or *F1*) and fellow the directions.
  If you are a first-time user, Type *C-h t* for a tutorial.

** remove help window                                         C-x 1
** scroll help window                                         C-M-v
** apropos: show commands matching a string                   C-h a
** describe the function a key runs                           C-h k
** describe a function                                        C-h f
** get mode-specific information                              C-h m
* Error Recovery
** abort partially typed or executing command                 C-g
** recover files lost by a system crash                       M-x recover-session
** undo an unwanted change                                    C-x C-_ or C-/
** resotre a buffer to its original contents                  M-x revert-buffer
** redraw garbaged screen                                     C-l
* Incremental Search
