emacs_study/Gnu_Emacs_Reference_Card.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-04 周六 14:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge69dc97">1. Leaving Emacs</a>
<ul>
<li><a href="#orged051eb">1.1. suspend Emacs (or inconify it under X)                      C-z</a></li>
<li><a href="#org6f4eb60">1.2. exit Emacs permanently                                      C-x C-c</a></li>
</ul>
</li>
<li><a href="#org5323eab">2. Files</a>
<ul>
<li><a href="#org07dc0c3">2.1. read a file into Emacs                                      C-x C-f</a></li>
<li><a href="#orge98011b">2.2. save a file back to disk                                    C-x C-s</a></li>
<li><a href="#org109f0c6">2.3. save all files                                              C-x s</a></li>
<li><a href="#orgb1f6772">2.4. insert contents of another file into this buffer            C-x i</a></li>
<li><a href="#org59b7f66">2.5. replace this file with the file you really want             C-x C-v</a></li>
<li><a href="#orgc6a3062">2.6. write buffer to a specified file                            C-x C-w</a></li>
<li><a href="#org4219901">2.7. toggle read-olny status of buffer                           C-x C-q</a></li>
</ul>
</li>
<li><a href="#orgbd915b6">3. Getting Help</a>
<ul>
<li><a href="#org2a7c5b3">3.1. remove help window                                         C-x 1</a></li>
<li><a href="#org2077377">3.2. scroll help window                                         C-M-v</a></li>
<li><a href="#org2452693">3.3. apropos: show commands matching a string                   C-h a</a></li>
<li><a href="#org7a6ff22">3.4. describe the function a key runs                           C-h k</a></li>
<li><a href="#org58d181c">3.5. describe a function                                        C-h f</a></li>
<li><a href="#org0bf02da">3.6. get mode-specific information                              C-h m</a></li>
</ul>
</li>
<li><a href="#org08ddf8f">4. Error Recovery</a>
<ul>
<li><a href="#org721f874">4.1. abort partially typed or executing command                 C-g</a></li>
<li><a href="#orge703ce9">4.2. recover files lost by a system crash                       M-x recover-session</a></li>
<li><a href="#org4320288">4.3. undo an unwanted change                                    C-x C-_ or C-/</a></li>
<li><a href="#org34af5b4">4.4. resotre a buffer to its original contents                  M-x revert-buffer</a></li>
<li><a href="#org45a8348">4.5. redraw garbaged screen                                     C-l</a></li>
</ul>
</li>
<li><a href="#org0205c93">5. Incremental Search</a>
<ul>
<li><a href="#org86b5f96">5.1. search forward                                             C-s</a></li>
<li><a href="#org96c14a6">5.2. search backword                                            C-r</a></li>
<li><a href="#orga985df6">5.3. regular expression search                                  C-M-s</a></li>
<li><a href="#orgd9091ff">5.4. reverse regular expression search                          C-M-r</a></li>
<li><a href="#org5cf9b8c">5.5. select previous search string                              M-p</a></li>
<li><a href="#orgd081d1d">5.6. select next search string                                  M-n</a></li>
<li><a href="#org7e622e3">5.7. exit incremental search                                    RET</a></li>
<li><a href="#org68bfabc">5.8. undo effect of last character                              DEL</a></li>
<li><a href="#org7e27724">5.9. abort current search                                       C-g</a></li>
</ul>
</li>
<li><a href="#org6c995c3">6. Shells</a>
<ul>
<li><a href="#orgea53479">6.1. excute a shell command                                    M-!</a></li>
<li><a href="#orgfeffea1">6.2. run a shell command on the region                         M-|</a></li>
<li><a href="#org4bc2f99">6.3. filter region through a shell command                     C-u M-|</a></li>
<li><a href="#org03c43cc">6.4. start a shell in window <b>shell</b>                           M-x shell</a></li>
</ul>
</li>
<li><a href="#org2a937f4">7. Transposing</a>
<ul>
<li><a href="#org48ecfa0">7.1. transpose characters                                      C-t</a></li>
<li><a href="#org4519100">7.2. transpose words                                           M-t</a></li>
<li><a href="#org890b5e9">7.3. transpose lines                                           C-x C-t</a></li>
<li><a href="#org6f81a0f">7.4. transpose sexps                                           C-M-t</a></li>
</ul>
</li>
<li><a href="#org4d84a2f">8. Motion</a>
<ul>
<li><a href="#org06b577d">8.1. base cusor moving</a></li>
<li><a href="#orgda111b9">8.2. scroll to next screen                                      C-v</a></li>
<li><a href="#org2f15fc8">8.3. scroll to previous screen                                  M-v</a></li>
<li><a href="#orgc9175e5">8.4. scroll left                                                C-x &gt;</a></li>
<li><a href="#org62c5389">8.5. scroll right                                               C-x &lt;</a></li>
<li><a href="#orgc782dd1">8.6. scroll current line to center of screent                   C-u C-l</a></li>
</ul>
</li>
<li><a href="#org7bf8e02">9. Killing and Deleting</a>
<ul>
<li><a href="#orgce27b2e">9.1. Base Killing and Deleting</a></li>
<li><a href="#orgafc7b9d">9.2. kill region                                                C-w</a></li>
<li><a href="#org51a0467">9.3. copy region to kill ring                                   M-w</a></li>
<li><a href="#orgabe3a1d">9.4. kill though next occurrentce of char                       M-z <i>char</i></a></li>
<li><a href="#org53c51d7">9.5. yank back last thing killed                                C-y</a></li>
<li><a href="#org18dc8d7">9.6. releace last yank with provious kill                       M-y</a></li>
</ul>
</li>
<li><a href="#org5fe0a22">10. Marking</a>
<ul>
<li><a href="#orga01aeef">10.1. set mark here                                             C-@ or C-SPC</a></li>
<li><a href="#orgb3653f5">10.2. exchange point and mark                                   C-x C-x</a></li>
<li><a href="#org1a46dad">10.3. set mark <i>arg</i> words away                                 M-@</a></li>
<li><a href="#orgbf6dedd">10.4. mark paragraph                                            M-h</a></li>
<li><a href="#org7961cba">10.5. mark page                                                 C-x C-p</a></li>
<li><a href="#org0a498d7">10.6. mark sexp                                                 C-M-@</a></li>
<li><a href="#org4a6d938">10.7. mark function                                             C-M-h</a></li>
<li><a href="#org816a1ed">10.8. mark entire buffer                                        C-x h</a></li>
</ul>
</li>
<li><a href="#orgda80d36">11. Query Replace</a>
<ul>
<li><a href="#org97ef050">11.1. interactively relpace a text string                       M-%</a></li>
</ul>
</li>
<li><a href="#org9467f67">12. Spelling Check</a>
<ul>
<li><a href="#orgcb1aa58">12.1. check spelling of current word                            M-%</a></li>
<li><a href="#org1179778">12.2. check spelling of all words in region                     M-x ispell-region</a></li>
<li><a href="#orgc3371a8">12.3. check spelling of entire                                  M-x ispell-buffer</a></li>
</ul>
</li>
<li><a href="#org3d0770b">13. Buffers</a>
<ul>
<li><a href="#org7ea353b">13.1. select another buffer                                     C-x b</a></li>
<li><a href="#org9276e5d">13.2. list all buffers                                          C-x C-b</a></li>
<li><a href="#org0a9a687">13.3. kill a buffer                                             C-x k</a></li>
</ul>
</li>
<li><a href="#org21f4a33">14. Multiple Windows</a></li>
<li><a href="#orga3412c0">15. Formatting</a></li>
<li><a href="#orga00a4a4">16. Case Change</a></li>
<li><a href="#org8fe7d34">17. The Minibuffer</a></li>
<li><a href="#orgd0ef2c0">18. Tags</a></li>
<li><a href="#org494d998">19. Rectangles</a></li>
<li><a href="#org6ed8038">20. Abbrevs</a></li>
<li><a href="#orgc5b9632">21. Registers</a></li>
<li><a href="#org8b886c7">22. Keyborad Macros</a></li>
<li><a href="#org5c269b1">23. Commands Dealing With Emacs Lisp</a></li>
<li><a href="#orgb784fe9">24. Sample Custiomization</a></li>
<li><a href="#org85080ff">25. Writing Commands</a></li>
</ul>
</div>
</div>
<p>
#+TITLE GNU Emacs Reference Card
</p>
<div id="outline-container-orge69dc97" class="outline-2">
<h2 id="orge69dc97"><span class="section-number-2">1</span> Leaving Emacs</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orged051eb" class="outline-3">
<h3 id="orged051eb"><span class="section-number-3">1.1</span> suspend Emacs (or inconify it under X)                      C-z</h3>
</div>
<div id="outline-container-org6f4eb60" class="outline-3">
<h3 id="org6f4eb60"><span class="section-number-3">1.2</span> exit Emacs permanently                                      C-x C-c</h3>
</div>
</div>
<div id="outline-container-org5323eab" class="outline-2">
<h2 id="org5323eab"><span class="section-number-2">2</span> Files</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org07dc0c3" class="outline-3">
<h3 id="org07dc0c3"><span class="section-number-3">2.1</span> read a file into Emacs                                      C-x C-f</h3>
</div>
<div id="outline-container-orge98011b" class="outline-3">
<h3 id="orge98011b"><span class="section-number-3">2.2</span> save a file back to disk                                    C-x C-s</h3>
</div>
<div id="outline-container-org109f0c6" class="outline-3">
<h3 id="org109f0c6"><span class="section-number-3">2.3</span> save all files                                              C-x s</h3>
</div>
<div id="outline-container-orgb1f6772" class="outline-3">
<h3 id="orgb1f6772"><span class="section-number-3">2.4</span> insert contents of another file into this buffer            C-x i</h3>
</div>
<div id="outline-container-org59b7f66" class="outline-3">
<h3 id="org59b7f66"><span class="section-number-3">2.5</span> replace this file with the file you really want             C-x C-v</h3>
</div>
<div id="outline-container-orgc6a3062" class="outline-3">
<h3 id="orgc6a3062"><span class="section-number-3">2.6</span> write buffer to a specified file                            C-x C-w</h3>
</div>
<div id="outline-container-org4219901" class="outline-3">
<h3 id="org4219901"><span class="section-number-3">2.7</span> toggle read-olny status of buffer                           C-x C-q</h3>
</div>
</div>
<div id="outline-container-orgbd915b6" class="outline-2">
<h2 id="orgbd915b6"><span class="section-number-2">3</span> Getting Help</h2>
<div class="outline-text-2" id="text-3">
<p>
The help system is simple. Type <b>C-h*(or *F1</b>) and fellow the directions.
If you are a first-time user, Type <b>C-h t</b> for a tutorial.
</p>
</div>

<div id="outline-container-org2a7c5b3" class="outline-3">
<h3 id="org2a7c5b3"><span class="section-number-3">3.1</span> remove help window                                         C-x 1</h3>
</div>
<div id="outline-container-org2077377" class="outline-3">
<h3 id="org2077377"><span class="section-number-3">3.2</span> scroll help window                                         C-M-v</h3>
</div>
<div id="outline-container-org2452693" class="outline-3">
<h3 id="org2452693"><span class="section-number-3">3.3</span> apropos: show commands matching a string                   C-h a</h3>
</div>
<div id="outline-container-org7a6ff22" class="outline-3">
<h3 id="org7a6ff22"><span class="section-number-3">3.4</span> describe the function a key runs                           C-h k</h3>
</div>
<div id="outline-container-org58d181c" class="outline-3">
<h3 id="org58d181c"><span class="section-number-3">3.5</span> describe a function                                        C-h f</h3>
</div>
<div id="outline-container-org0bf02da" class="outline-3">
<h3 id="org0bf02da"><span class="section-number-3">3.6</span> get mode-specific information                              C-h m</h3>
</div>
</div>
<div id="outline-container-org08ddf8f" class="outline-2">
<h2 id="org08ddf8f"><span class="section-number-2">4</span> Error Recovery</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org721f874" class="outline-3">
<h3 id="org721f874"><span class="section-number-3">4.1</span> abort partially typed or executing command                 C-g</h3>
</div>
<div id="outline-container-orge703ce9" class="outline-3">
<h3 id="orge703ce9"><span class="section-number-3">4.2</span> recover files lost by a system crash                       M-x recover-session</h3>
</div>
<div id="outline-container-org4320288" class="outline-3">
<h3 id="org4320288"><span class="section-number-3">4.3</span> undo an unwanted change                                    C-x C-_ or C-/</h3>
</div>
<div id="outline-container-org34af5b4" class="outline-3">
<h3 id="org34af5b4"><span class="section-number-3">4.4</span> resotre a buffer to its original contents                  M-x revert-buffer</h3>
</div>
<div id="outline-container-org45a8348" class="outline-3">
<h3 id="org45a8348"><span class="section-number-3">4.5</span> redraw garbaged screen                                     C-l</h3>
</div>
</div>
