emacs_study/Gnu_Emacs_Reference_Card.org
** search forward                                             C-s
** search backword                                            C-r
** regular expression search                                  C-M-s
** reverse regular expression search                          C-M-r
** select previous search string                              M-p
** select next search string                                  M-n
** exit incremental search                                    RET
** undo effect of last character                              DEL
** abort current search                                       C-g

   Use *C-s* or *C-r* again to repeat the search in either direction. If Emacs is 
 still searching, *C-g* cancels only the part not matched.

* Shells
** excute a shell command                                    M-!
** run a shell command on the region                         M-|
** filter region through a shell command                     C-u M-|
** start a shell in window *shell*                           M-x shell

* Transposing
** transpose characters                                      C-t
** transpose words                                           M-t
** transpose lines                                           C-x C-t
** transpose sexps                                           C-M-t

* Motion
** base cusor moving

#+CAPTION Emacs cusor moving
| entity to move over             | backward | forward |
|---------------------------------+----------+---------|
| character                       | C-b      | C-f     |
| word                            | M-b      | M-f     |
| line                            | C-p      | C-n     |
| go to line beginning (or end)   | C-a      | C-e     |
| sentence                        | M-a      | M-e     |
| paragraph                       | M-{      | M-}     |
| page                            | C-x [    | C-x ]   |
| sexp                            | C-M-b    | C-M-f   |
| function                        | C-M-a    | C-M-e   |
| go to buffer beginning (or end) | M-<      | M->     |
|---------------------------------+----------+---------|
                        
** scroll to next screen                                      C-v                              
** scroll to previous screen                                  M-v
** scroll left                                                C-x >
** scroll right                                               C-x <
** scroll current line to center of screent                   C-u C-l

* Killing and Deleting
** Base Killing and Deleting
#+CAPTION Base Killing and Deleting
| entity to kill              | backward  | forward |
|-----------------------------+-----------+---------|
| character (delete, not kill | DEL       | C-d     |
| word                        | M-DEL     | M-d     |
| line (to end of)            | M-0 C-k   | M-k     |
| sentence                    | C-x DEL   | M-k     |
| sexp                        | M-- C-M-k | C-M-k   |
|-----------------------------+-----------+---------|

** kill region                                                C-w
** copy region to kill ring                                   M-w
** kill though next occurrentce of char                       M-z /char/
** yank back last thing killed                                C-y  
** releace last yank with provious kill                       M-y

* Marking
** set mark here                                             C-@ or C-SPC
** exchange point and mark                                   C-x C-x
** set mark /arg/ words away                                 M-@
** mark paragraph                                            M-h
** mark page                                                 C-x C-p
** mark sexp                                                 C-M-@
** mark function                                             C-M-h
** mark entire buffer                                        C-x h
* Query Replace
** interactively relpace a text string                       M-%
