emacs_study/Gnu_Emacs_Reference_Card.html
<div id="outline-container-org0205c93" class="outline-2">
<h2 id="org0205c93"><span class="section-number-2">5</span> Incremental Search</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org86b5f96" class="outline-3">
<h3 id="org86b5f96"><span class="section-number-3">5.1</span> search forward                                             C-s</h3>
</div>
<div id="outline-container-org96c14a6" class="outline-3">
<h3 id="org96c14a6"><span class="section-number-3">5.2</span> search backword                                            C-r</h3>
</div>
<div id="outline-container-orga985df6" class="outline-3">
<h3 id="orga985df6"><span class="section-number-3">5.3</span> regular expression search                                  C-M-s</h3>
</div>
<div id="outline-container-orgd9091ff" class="outline-3">
<h3 id="orgd9091ff"><span class="section-number-3">5.4</span> reverse regular expression search                          C-M-r</h3>
</div>
<div id="outline-container-org5cf9b8c" class="outline-3">
<h3 id="org5cf9b8c"><span class="section-number-3">5.5</span> select previous search string                              M-p</h3>
</div>
<div id="outline-container-orgd081d1d" class="outline-3">
<h3 id="orgd081d1d"><span class="section-number-3">5.6</span> select next search string                                  M-n</h3>
</div>
<div id="outline-container-org7e622e3" class="outline-3">
<h3 id="org7e622e3"><span class="section-number-3">5.7</span> exit incremental search                                    RET</h3>
</div>
<div id="outline-container-org68bfabc" class="outline-3">
<h3 id="org68bfabc"><span class="section-number-3">5.8</span> undo effect of last character                              DEL</h3>
</div>
<div id="outline-container-org7e27724" class="outline-3">
<h3 id="org7e27724"><span class="section-number-3">5.9</span> abort current search                                       C-g</h3>
<div class="outline-text-3" id="text-5-9">
<p>
  Use <b>C-s</b> or <b>C-r</b> again to repeat the search in either direction. If Emacs is 
still searching, <b>C-g</b> cancels only the part not matched.
</p>
</div>
</div>
</div>

<div id="outline-container-org6c995c3" class="outline-2">
<h2 id="org6c995c3"><span class="section-number-2">6</span> Shells</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgea53479" class="outline-3">
<h3 id="orgea53479"><span class="section-number-3">6.1</span> excute a shell command                                    M-!</h3>
</div>
<div id="outline-container-orgfeffea1" class="outline-3">
<h3 id="orgfeffea1"><span class="section-number-3">6.2</span> run a shell command on the region                         M-|</h3>
</div>
<div id="outline-container-org4bc2f99" class="outline-3">
<h3 id="org4bc2f99"><span class="section-number-3">6.3</span> filter region through a shell command                     C-u M-|</h3>
</div>
<div id="outline-container-org03c43cc" class="outline-3">
<h3 id="org03c43cc"><span class="section-number-3">6.4</span> start a shell in window <b>shell</b>                           M-x shell</h3>
</div>
</div>

<div id="outline-container-org2a937f4" class="outline-2">
<h2 id="org2a937f4"><span class="section-number-2">7</span> Transposing</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org48ecfa0" class="outline-3">
<h3 id="org48ecfa0"><span class="section-number-3">7.1</span> transpose characters                                      C-t</h3>
</div>
<div id="outline-container-org4519100" class="outline-3">
<h3 id="org4519100"><span class="section-number-3">7.2</span> transpose words                                           M-t</h3>
</div>
<div id="outline-container-org890b5e9" class="outline-3">
<h3 id="org890b5e9"><span class="section-number-3">7.3</span> transpose lines                                           C-x C-t</h3>
</div>
<div id="outline-container-org6f81a0f" class="outline-3">
<h3 id="org6f81a0f"><span class="section-number-3">7.4</span> transpose sexps                                           C-M-t</h3>
</div>
</div>

<div id="outline-container-org4d84a2f" class="outline-2">
<h2 id="org4d84a2f"><span class="section-number-2">8</span> Motion</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org06b577d" class="outline-3">
<h3 id="org06b577d"><span class="section-number-3">8.1</span> base cusor moving</h3>
<div class="outline-text-3" id="text-8-1">
<p>
#+CAPTION Emacs cusor moving
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">entity to move over</th>
<th scope="col" class="org-left">backward</th>
<th scope="col" class="org-left">forward</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">character</td>
<td class="org-left">C-b</td>
<td class="org-left">C-f</td>
</tr>

<tr>
<td class="org-left">word</td>
<td class="org-left">M-b</td>
<td class="org-left">M-f</td>
</tr>

<tr>
<td class="org-left">line</td>
<td class="org-left">C-p</td>
<td class="org-left">C-n</td>
</tr>

<tr>
<td class="org-left">go to line beginning (or end)</td>
<td class="org-left">C-a</td>
<td class="org-left">C-e</td>
</tr>

<tr>
<td class="org-left">sentence</td>
<td class="org-left">M-a</td>
<td class="org-left">M-e</td>
</tr>

<tr>
<td class="org-left">paragraph</td>
<td class="org-left">M-{</td>
<td class="org-left">M-}</td>
</tr>

<tr>
<td class="org-left">page</td>
<td class="org-left">C-x [</td>
<td class="org-left">C-x ]</td>
</tr>

<tr>
<td class="org-left">sexp</td>
<td class="org-left">C-M-b</td>
<td class="org-left">C-M-f</td>
</tr>

<tr>
<td class="org-left">function</td>
<td class="org-left">C-M-a</td>
<td class="org-left">C-M-e</td>
</tr>

<tr>
<td class="org-left">go to buffer beginning (or end)</td>
<td class="org-left">M-&lt;</td>
<td class="org-left">M-&gt;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgda111b9" class="outline-3">
<h3 id="orgda111b9"><span class="section-number-3">8.2</span> scroll to next screen                                      C-v</h3>
</div>
<div id="outline-container-org2f15fc8" class="outline-3">
<h3 id="org2f15fc8"><span class="section-number-3">8.3</span> scroll to previous screen                                  M-v</h3>
</div>
<div id="outline-container-orgc9175e5" class="outline-3">
<h3 id="orgc9175e5"><span class="section-number-3">8.4</span> scroll left                                                C-x &gt;</h3>
</div>
<div id="outline-container-org62c5389" class="outline-3">
<h3 id="org62c5389"><span class="section-number-3">8.5</span> scroll right                                               C-x &lt;</h3>
</div>
<div id="outline-container-orgc782dd1" class="outline-3">
<h3 id="orgc782dd1"><span class="section-number-3">8.6</span> scroll current line to center of screent                   C-u C-l</h3>
</div>
</div>

<div id="outline-container-org7bf8e02" class="outline-2">
<h2 id="org7bf8e02"><span class="section-number-2">9</span> Killing and Deleting</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgce27b2e" class="outline-3">
<h3 id="orgce27b2e"><span class="section-number-3">9.1</span> Base Killing and Deleting</h3>
<div class="outline-text-3" id="text-9-1">
<p>
#+CAPTION Base Killing and Deleting
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">entity to kill</th>
<th scope="col" class="org-left">backward</th>
<th scope="col" class="org-left">forward</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">character (delete, not kill</td>
<td class="org-left">DEL</td>
<td class="org-left">C-d</td>
</tr>

<tr>
<td class="org-left">word</td>
<td class="org-left">M-DEL</td>
<td class="org-left">M-d</td>
</tr>

<tr>
<td class="org-left">line (to end of)</td>
<td class="org-left">M-0 C-k</td>
<td class="org-left">M-k</td>
</tr>

<tr>
<td class="org-left">sentence</td>
<td class="org-left">C-x DEL</td>
<td class="org-left">M-k</td>
</tr>

<tr>
<td class="org-left">sexp</td>
<td class="org-left">M&#x2013; C-M-k</td>
<td class="org-left">C-M-k</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgafc7b9d" class="outline-3">
<h3 id="orgafc7b9d"><span class="section-number-3">9.2</span> kill region                                                C-w</h3>
</div>
<div id="outline-container-org51a0467" class="outline-3">
<h3 id="org51a0467"><span class="section-number-3">9.3</span> copy region to kill ring                                   M-w</h3>
</div>
<div id="outline-container-orgabe3a1d" class="outline-3">
<h3 id="orgabe3a1d"><span class="section-number-3">9.4</span> kill though next occurrentce of char                       M-z <i>char</i></h3>
</div>
<div id="outline-container-org53c51d7" class="outline-3">
<h3 id="org53c51d7"><span class="section-number-3">9.5</span> yank back last thing killed                                C-y</h3>
</div>
<div id="outline-container-org18dc8d7" class="outline-3">
<h3 id="org18dc8d7"><span class="section-number-3">9.6</span> releace last yank with provious kill                       M-y</h3>
</div>
</div>

<div id="outline-container-org5fe0a22" class="outline-2">
<h2 id="org5fe0a22"><span class="section-number-2">10</span> Marking</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-orga01aeef" class="outline-3">
<h3 id="orga01aeef"><span class="section-number-3">10.1</span> set mark here                                             C-@ or C-SPC</h3>
</div>
<div id="outline-container-orgb3653f5" class="outline-3">
<h3 id="orgb3653f5"><span class="section-number-3">10.2</span> exchange point and mark                                   C-x C-x</h3>
</div>
<div id="outline-container-org1a46dad" class="outline-3">
<h3 id="org1a46dad"><span class="section-number-3">10.3</span> set mark <i>arg</i> words away                                 M-@</h3>
</div>
<div id="outline-container-orgbf6dedd" class="outline-3">
<h3 id="orgbf6dedd"><span class="section-number-3">10.4</span> mark paragraph                                            M-h</h3>
</div>
<div id="outline-container-org7961cba" class="outline-3">
<h3 id="org7961cba"><span class="section-number-3">10.5</span> mark page                                                 C-x C-p</h3>
</div>
<div id="outline-container-org0a498d7" class="outline-3">
<h3 id="org0a498d7"><span class="section-number-3">10.6</span> mark sexp                                                 C-M-@</h3>
</div>
<div id="outline-container-org4a6d938" class="outline-3">
<h3 id="org4a6d938"><span class="section-number-3">10.7</span> mark function                                             C-M-h</h3>
</div>
<div id="outline-container-org816a1ed" class="outline-3">
<h3 id="org816a1ed"><span class="section-number-3">10.8</span> mark entire buffer                                        C-x h</h3>
</div>
</div>
<div id="outline-container-orgda80d36" class="outline-2">
<h2 id="orgda80d36"><span class="section-number-2">11</span> Query Replace</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org97ef050" class="outline-3">
<h3 id="org97ef050"><span class="section-number-3">11.1</span> interactively relpace a text string                       M-%</h3>
</div>
</div>
