emacs_study/Gnu_Emacs_Reference_Card.org
* Spelling Check
** check spelling of current word                            M-%
** check spelling of all words in region                     M-x ispell-region
** check spelling of entire                                  M-x ispell-buffer
* Buffers
** select another buffer                                     C-x b
** list all buffers                                          C-x C-b
** kill a buffer                                             C-x k
* Multiple Windows
* Formatting 
* Case Change
* The Minibuffer
* Tags
* Rectangles
* Abbrevs
* Registers
* Keyborad Macros
* Commands Dealing With Emacs Lisp
* Sample Custiomization
* Writing Commands
