emacs_study/Gnu_Emacs_Reference_Card.html
<div id="outline-container-org9467f67" class="outline-2">
<h2 id="org9467f67"><span class="section-number-2">12</span> Spelling Check</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-orgcb1aa58" class="outline-3">
<h3 id="orgcb1aa58"><span class="section-number-3">12.1</span> check spelling of current word                            M-%</h3>
</div>
<div id="outline-container-org1179778" class="outline-3">
<h3 id="org1179778"><span class="section-number-3">12.2</span> check spelling of all words in region                     M-x ispell-region</h3>
</div>
<div id="outline-container-orgc3371a8" class="outline-3">
<h3 id="orgc3371a8"><span class="section-number-3">12.3</span> check spelling of entire                                  M-x ispell-buffer</h3>
</div>
</div>
<div id="outline-container-org3d0770b" class="outline-2">
<h2 id="org3d0770b"><span class="section-number-2">13</span> Buffers</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org7ea353b" class="outline-3">
<h3 id="org7ea353b"><span class="section-number-3">13.1</span> select another buffer                                     C-x b</h3>
</div>
<div id="outline-container-org9276e5d" class="outline-3">
<h3 id="org9276e5d"><span class="section-number-3">13.2</span> list all buffers                                          C-x C-b</h3>
</div>
<div id="outline-container-org0a9a687" class="outline-3">
<h3 id="org0a9a687"><span class="section-number-3">13.3</span> kill a buffer                                             C-x k</h3>
</div>
</div>
<div id="outline-container-org21f4a33" class="outline-2">
<h2 id="org21f4a33"><span class="section-number-2">14</span> Multiple Windows</h2>
</div>
<div id="outline-container-orga3412c0" class="outline-2">
<h2 id="orga3412c0"><span class="section-number-2">15</span> Formatting</h2>
</div>
<div id="outline-container-orga00a4a4" class="outline-2">
<h2 id="orga00a4a4"><span class="section-number-2">16</span> Case Change</h2>
</div>
<div id="outline-container-org8fe7d34" class="outline-2">
<h2 id="org8fe7d34"><span class="section-number-2">17</span> The Minibuffer</h2>
</div>
<div id="outline-container-orgd0ef2c0" class="outline-2">
<h2 id="orgd0ef2c0"><span class="section-number-2">18</span> Tags</h2>
</div>
<div id="outline-container-org494d998" class="outline-2">
<h2 id="org494d998"><span class="section-number-2">19</span> Rectangles</h2>
</div>
<div id="outline-container-org6ed8038" class="outline-2">
<h2 id="org6ed8038"><span class="section-number-2">20</span> Abbrevs</h2>
</div>
<div id="outline-container-orgc5b9632" class="outline-2">
<h2 id="orgc5b9632"><span class="section-number-2">21</span> Registers</h2>
</div>
<div id="outline-container-org8b886c7" class="outline-2">
<h2 id="org8b886c7"><span class="section-number-2">22</span> Keyborad Macros</h2>
</div>
<div id="outline-container-org5c269b1" class="outline-2">
<h2 id="org5c269b1"><span class="section-number-2">23</span> Commands Dealing With Emacs Lisp</h2>
</div>
<div id="outline-container-orgb784fe9" class="outline-2">
<h2 id="orgb784fe9"><span class="section-number-2">24</span> Sample Custiomization</h2>
</div>
<div id="outline-container-org85080ff" class="outline-2">
<h2 id="org85080ff"><span class="section-number-2">25</span> Writing Commands</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-08-04 周六 14:00</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
